01-ahmed-body/cases/slant25_re4.29M_symtest_transient/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform $pressure;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           $internalField;
    }
    ground
    {
        type            zeroGradient;
    }
    top
    {
        type            slip;
    }
    symmetryPlane
    {
        type            symmetryPlane;
    }
    farfield
    {
        type            slip;
    }
    ahmedBody
    {
        type            zeroGradient;
    }
}
// ************************************************************************* //
