01-ahmed-body/cases/slant25_re4.29M_symtest_transient/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     foamRun;

solver          incompressibleFluid;

// DIAGNOSTIC TEST: starting from uniform initial conditions (0/)
// instead of resuming from the SIMPLEC steady solution (2000/), to
// isolate whether the anomalously high Courant number (reported
// ~1037 mean / ~107343 max, vs ~0.5 expected) is caused by an
// inconsistent phi field inherited from the SIMPLEC resume, or by
// something else (e.g. our deltaT/Co calculation methodology).
startFrom       latestTime;
startTime       0;
stopAt          endTime;
endTime         0.2;

// Initial deltaT computed from actual mesh/solution data (not guessed):
// finest cell = 0.9598mm, max velocity = 96.2 m/s in domain (see
// mesh_development_log.md derivation), targeting Co<=0.5 at the most
// restrictive location. adjustTimeStep will self-correct from here.
deltaT          5e-06;
adjustTimeStep  yes;
maxCo           0.5;

writeControl    adjustableRunTime;
writeInterval   0.001;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    #include "forceCoeffs"
}

// ************************************************************************* //
