01-ahmed-body/cases/slant25_re4.29M_symtest_transient/system/surfaceFeaturesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      surfaceFeaturesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaces ("ahmedBody.stl");

// Identify a feature when angle between faces < includedAngle.
// Catches the sharp slant/roof and side edges of the Ahmed body
// while ignoring the smoothly-tessellated front fillet.
includedAngle   150;

subsetFeatures
{
    nonManifoldEdges    yes;
    openEdges           yes;
}

// ************************************************************************* //
